

//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти
//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьВстречиПараллельно(МассивНаУдалениеМероприятий) Экспорт
	МассивМероприятий = МассивНаУдалениеМероприятий;
	МассивМероприятий.Удалить(0);				
	ПараметрыПроцедуры = Новый Массив;
	ПараметрыПроцедуры.Добавить(МассивМероприятий);			
	ЗаданиеЛаст = ФоновыеЗадания.Выполнить("УдалениеМероприятийЦиклУдаленийВызовСервера.ЦиклУдалений", ПараметрыПроцедуры, Строка(Новый УникальныйИдентификатор), "События");
	
	ЗаданиеЛаст = ЗаданиеЛаст.ОжидатьЗавершенияВыполнения(5);
	Пока ЗаданиеЛаст.Состояние = СостояниеФоновогоЗадания.Активно Цикл
		ЗаданиеЛаст = ЗаданиеЛаст.ОжидатьЗавершенияВыполнения(5);
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти


