//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЦиклСоздания (ПараметрыПроцедуры, ВерхняяГраница) Экспорт	
	
	НачатьТранзакцию();
	Для Сч = 0 По ВерхняяГраница Цикл
		НовоеМероприятие = Справочники.МероприятияПредприятия.СоздатьЭлемент();
		НовоеМероприятие.СвязаноС = ПараметрыПроцедуры[Сч].Наименование;
		НовоеМероприятие.Наименование = ПараметрыПроцедуры[Сч].Наименование;
		НовоеМероприятие.ДатаНачалаМероприятия = ПараметрыПроцедуры[Сч].ДатаНачалаМероприятия;
		НовоеМероприятие.ДатаОкончанияМероприятия = ПараметрыПроцедуры[Сч].ДатаОкончанияМероприятия;
		НовоеМероприятие.СсылкаНаСвязноС = ПараметрыПроцедуры[Сч].Ссылка;
		НовоеМероприятие.Записать();
		
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	
КонецПроцедуры

#КонецОбласти

