#Область СлужебныеПроцедурыИФункции

Процедура  ПроверитьСообщенияВЦикле(ПараметрыПроцедуры) Экспорт
	
	МассивСтруктур = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяПользователя",ПараметрыПроцедуры[0]);
	Запрос.УстановитьПараметр("Подписан", Перечисления.СтатусДокумента.Подписан);
	Запрос.Текст = 	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.ОбсужденияКЗадаче.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Сообщение КАК Сообщение,
	|		Отправитель КАК Отправитель,
	|		ВремяСоздания КАК ВремяСоздания,
	|		Просмотренно КАК Просмотренно
	|	) КАК ОбсужденияКЗадаче,
	|	Документ.ОтКого КАК ОтКого,
	|	Документ.ДляКого КАК ДляКого,
	|	Документ.ЛицаКЗадаче.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ЛицаПривлеченныеКЗадаче КАК ЛицаПривлеченныеКЗадаче,
	|		ПросмотренноЛицаКЗадаче КАК ПросмотренноЛицаКЗадаче
	|	) КАК ЛицаКЗадаче,
	|	Документ.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	Задача.Документ КАК Документ
	|ГДЕ
	|	Документ.СтатусДокумента <> &Подписан";
	
	РузультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого СообщенияВДокументх Из РузультатЗапроса Цикл
		//ПолучитьПоследнийИндексСообщения = СообщенияВДокументх.ОбсужденияКЗадаче.Индекс(СообщенияВДокументх.ОбсужденияКЗадаче.Количество() - 1); 
		НайтиОбъектДляЗаписи = Задачи.Документ.НайтиПоНомеру(СообщенияВДокументх.Ссылка.Номер);
		ПолучитьОбъектДляЗаписи = НайтиОбъектДляЗаписи.ПолучитьОбъект();
		СколькоСтрок = НайтиОбъектДляЗаписи.ОбсужденияКЗадаче.Количество();
		Если СколькоСтрок = 0 Тогда
			Продолжить;
			
			
		КонецЕсли;
		ПоследнееСообщение = ПолучитьОбъектДляЗаписи.ОбсужденияКЗадаче[СколькоСтрок - 1];
		//Уведомляем всех участиников
		Плучим = ПолучитьОбъектДляЗаписи.ЛицаКЗадаче.Выгрузить();
		Для каждого Строка Из Плучим Цикл
			Если Строка.ПросмотренноЛицаКЗадаче = Ложь И Строка(Строка.ЛицаПривлеченныеКЗадаче) = ПараметрыПроцедуры[0] И ПоследнееСообщение.Отправитель <> ПараметрыПроцедуры[0]  Тогда
				СсылкаНаЗадачу = ПолучитьНавигационнуюСсылку(СообщенияВДокументх.Ссылка);
				СтруктураСообщенийИЗадач = Новый Структура;
				//СтруктураСообщенийИЗадач.Вставить("ДатаСообщения",ПоследнееСообщение.ВремяСоздания);
				СтруктураСообщенийИЗадач.Вставить("НомерЗадачи",СообщенияВДокументх.Ссылка.Номер);
				СтруктураСообщенийИЗадач.Вставить("НавСсылка",СсылкаНаЗадачу);
				СтруктураСообщенийИЗадач.Вставить("Отправитель",ПоследнееСообщение.Отправитель);
				СтруктураСообщенийИЗадач.Вставить("ТекстСообщения",ПоследнееСообщение.Сообщение);
				МассивСтруктур.Добавить(СтруктураСообщенийИЗадач);
				ПолучитьОбъектДляЗаписи = НайтиОбъектДляЗаписи.ПолучитьОбъект();
				ПолучитьОбъектДляЗаписи.ЛицаКЗадаче[Строка.НомерСтроки - 1].ПросмотренноЛицаКЗадаче = Истина;
				Если Строка(ПолучитьОбъектДляЗаписи.ДляКого) = Строка(Строка.ЛицаПривлеченныеКЗадаче)  Тогда
					ПолучитьОбъектДляЗаписи.ОбсужденияКЗадаче[СколькоСтрок - 1].ПросмотренноИсполнителем = Истина;
					
					
				КонецЕсли;
				//ПолучитьОбъектДляЗаписи.ОбсужденияКЗадаче[СколькоСтрок - 1].Просмотренно = Истина;
				
				ПолучитьОбъектДляЗаписи.Записать();
			КонецЕсли;
			
			
		КонецЦикла;
		//Уведомляем всех участиников
		
		
		Если ПоследнееСообщение.Просмотренно = Ложь И Строка(ПолучитьОбъектДляЗаписи.ОтКого) = ПараметрыПроцедуры[0] И ПоследнееСообщение.Отправитель <> ПараметрыПроцедуры[0] Тогда
			СсылкаНаЗадачу = ПолучитьНавигационнуюСсылку(СообщенияВДокументх.Ссылка);
			СтруктураСообщенийИЗадач = Новый Структура;
			//СтруктураСообщенийИЗадач.Вставить("ДатаСообщения",ПоследнееСообщение.ВремяСоздания);
			СтруктураСообщенийИЗадач.Вставить("НомерЗадачи",СообщенияВДокументх.Ссылка.Номер);
			СтруктураСообщенийИЗадач.Вставить("НавСсылка",СсылкаНаЗадачу);
			СтруктураСообщенийИЗадач.Вставить("Отправитель",ПоследнееСообщение.Отправитель);
			СтруктураСообщенийИЗадач.Вставить("ТекстСообщения",ПоследнееСообщение.Сообщение);
			МассивСтруктур.Добавить(СтруктураСообщенийИЗадач);
			//ПоследнееСообщение.Просмотренно = Истина;
			ПолучитьОбъектДляЗаписи = НайтиОбъектДляЗаписи.ПолучитьОбъект();
			ПолучитьОбъектДляЗаписи.ОбсужденияКЗадаче[СколькоСтрок - 1].Просмотренно = Истина;
			ПолучитьОбъектДляЗаписи.Записать();
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	ПоместитьВоВременноеХранилище(МассивСтруктур, ПараметрыПроцедуры[1]);	
КонецПроцедуры

#КонецОбласти


