//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВстречиПараллельно (МассивМероприятий) Экспорт
	МероприятияПроекта = МассивМероприятий;
	ВсеМероприятия = МероприятияПроекта.Количество();
	КрайМассива = МассивМероприятий.ВГраница();
	ПроверкаКратности = ВсеМероприятия%10;
	СколькоМероприятийВОдноЗадание = ВсеМероприятия/10;
	ДоКакогоИндексаРавномерныеЧасти = КрайМассива - ПроверкаКратности;
	Ааа = ДоКакогоИндексаРавномерныеЧасти + 1;
	Если  ПроверкаКратности <> 0 Тогда
		МассивОстатокНаименьшейПорции = Новый Массив;
		Для Ггг = Ааа  По КрайМассива Цикл	
			МассивОстатокНаименьшейПорции.Добавить(МассивМероприятий[Ггг]);
			//МассивМероприятий.Удалить(ааа);
		КонецЦикла;
		Для ммм = Ааа  По КрайМассива Цикл	
			ПоследнийСобытие = МассивМероприятий.Количество() - 1;
			МассивМероприятий.Удалить(ПоследнийСобытие);
		КонецЦикла;
	КонецЕсли;
	
	
	Для  Сч = 1 По 10 Цикл
		СколькоЕщеНаЗаписаноМероприятий = МассивМероприятий.ВГраница();
		МассивДолей = Новый Массив;
		ПоследнийИндексПорций = Цел(СколькоМероприятийВОдноЗадание) - 1;
		Если Сч < 10 Тогда 
			Для Индекс = 0 По ПоследнийИндексПорций Цикл
				СколькоЕщеНаЗаписаноМероприятий = МассивМероприятий.ВГраница();
				МассивДолей.Добавить(МассивМероприятий[Индекс]);
				МассивМероприятий.Удалить(Индекс);
			КонецЦикла;
		Иначе
			Для Индекс = 0 По СколькоЕщеНаЗаписаноМероприятий Цикл
				СколькоЕщеНаЗаписаноМероприятий = МассивМероприятий.ВГраница();
				МассивДолей.Добавить(МассивМероприятий[Индекс]);
			КонецЦикла;
			
		КонецЕсли;
		
		
		ПараметрыПроцедуры = Новый Массив;		
		ПараметрыПроцедуры.Добавить(МассивДолей);
		ВерхняяГраница = ПараметрыПроцедуры[0].ВГраница();
		ПараметрыПроцедуры.Добавить(ВерхняяГраница);
		Задание = ФоновыеЗадания.Выполнить("СоздатьВстерчиПотокиЦиклСозданияВызовСервера.ЦиклСоздания", ПараметрыПроцедуры, Строка(Новый УникальныйИдентификатор), "События"+Сч);
		
		
		Задание = Задание.ОжидатьЗавершенияВыполнения(5);
		Пока Задание.Состояние = СостояниеФоновогоЗадания.Активно Цикл
			Задание = Задание.ОжидатьЗавершенияВыполнения(5);
		КонецЦикла;		
		
	КонецЦикла;
	
	
	Если ТипЗнч(МассивОстатокНаименьшейПорции) <> Тип("Неопределено") Тогда
		ПараметрыПроцедуры = Новый Массив;
		ПараметрыПроцедуры.Добавить(МассивОстатокНаименьшейПорции);	
		ВерхняяГраница = ПараметрыПроцедуры[0].ВГраница();
		ПараметрыПроцедуры.Добавить(ВерхняяГраница);
		
		ЗаданиеЛаст = ФоновыеЗадания.Выполнить("СоздатьВстерчиПотокиЦиклСозданияВызовСервера.ЦиклСоздания", ПараметрыПроцедуры, Строка(Новый УникальныйИдентификатор), "События"+Сч);
		
		ЗаданиеЛаст = ЗаданиеЛаст.ОжидатьЗавершенияВыполнения(5);
		Пока ЗаданиеЛаст.Состояние = СостояниеФоновогоЗадания.Активно Цикл
			ЗаданиеЛаст = ЗаданиеЛаст.ОжидатьЗавершенияВыполнения(5);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


