

//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти
//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура  ПинганутьПлучателя(ПараметрыПроцедуры) Экспорт
	
	НоваяЗапись = РегистрыСведений.УпоминанияВКоментарияхДокумента.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВремяОтправления = ТекущаяДата();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.СтатусДоставки = Ложь;
	НоваяЗапись.Отправитель = ПараметрыПроцедуры[1];
	НоваяЗапись.Получатель = ПараметрыПроцедуры[2];
	НоваяЗапись.СсылкаНаДокумент = ПараметрыПроцедуры[3];
	НоваяЗапись.НомерДокумента = ПараметрыПроцедуры[0]; 
	НоваяЗапись.Записать();	
	
	
КонецПроцедуры

#КонецОбласти