&НаСервере
Процедура ПриОткрытииНаСервере(ВыбраннаяДата)
	ЗапросПоКоличесвуСотрудник = Новый Запрос;
	ЗапросПоКоличесвуСотрудник.Текст =  "ВЫБРАТЬ
	                                    |	Задача.Ссылка КАК Ссылка,
	                                    |	Задача.ВерсияДанных КАК ВерсияДанных,
	                                    |	Задача.ПометкаУдаления КАК ПометкаУдаления,
	                                    |	Задача.Номер КАК Номер,
	                                    |	Задача.Дата КАК Дата,
	                                    |	Задача.Наименование КАК Наименование,
	                                    |	Задача.Выполнена КАК Выполнена,
	                                    |	Задача.СтатусЗадачи КАК СтатусЗадачи,
	                                    |	Задача.ОтКого КАК ОтКого,
	                                    |	Задача.ДляКого КАК ДляКого,
	                                    |	Задача.ПланируемаяДатаЗавершения КАК ПланируемаяДатаЗавершения,
	                                    |	Задача.ПояснениеКЗадаче КАК ПояснениеКЗадаче,
	                                    |	Задача.ОтчетИсполнителя КАК ОтчетИсполнителя,
	                                    |	Задача.Блокеры КАК Блокеры,
	                                    |	Задача.ДатаФактическогоЗавершения КАК ДатаФактическогоЗавершения,
	                                    |	Задача.МаксимальноеКоличествоЧасов КАК МаксимальноеКоличествоЧасов,
	                                    |	Задача.ПланируемоеКоличествоЧасов КАК ПланируемоеКоличествоЧасов,
	                                    |	Задача.ФактическиЗатраченноеВремя КАК ФактическиЗатраченноеВремя,
	                                    |	Задача.Отдел КАК Отдел,
	                                    |	Задача.Повторить КАК Повторить,
	                                    |	Задача.КакЧастоПовторять КАК КакЧастоПовторять,
	                                    |	Задача.СогласованныйБюджет КАК СогласованныйБюджет,
	                                    |	Задача.ФактическиеЗатраты КАК ФактическиеЗатраты,
	                                    |	Задача.ФайлыКЗадаче.(
	                                    |		Ссылка КАК Ссылка,
	                                    |		НомерСтроки КАК НомерСтроки,
	                                    |		ДатаДобавления КАК ДатаДобавления,
	                                    |		НаименованиеФайла КАК НаименованиеФайла,
	                                    |		СсылкаАдрес КАК СсылкаАдрес
	                                    |	) КАК ФайлыКЗадаче,
	                                    |	Задача.ЛицаКЗадаче.(
	                                    |		Ссылка КАК Ссылка,
	                                    |		НомерСтроки КАК НомерСтроки,
	                                    |		ЛицаПривлеченныеКЗадаче КАК ЛицаПривлеченныеКЗадаче,
	                                    |		ПросмотренноЛицаКЗадаче КАК ПросмотренноЛицаКЗадаче
	                                    |	) КАК ЛицаКЗадаче,
	                                    |	Задача.СвязанныеЗадачи.(
	                                    |		Ссылка КАК Ссылка,
	                                    |		НомерСтроки КАК НомерСтроки,
	                                    |		Задачи КАК Задачи
	                                    |	) КАК СвязанныеЗадачи,
	                                    |	Задача.ОбсужденияКЗадаче.(
	                                    |		Ссылка КАК Ссылка,
	                                    |		НомерСтроки КАК НомерСтроки,
	                                    |		Сообщение КАК Сообщение,
	                                    |		Отправитель КАК Отправитель,
	                                    |		ВремяСоздания КАК ВремяСоздания,
	                                    |		Просмотренно КАК Просмотренно,
	                                    |		ПросмотренноИсполнителем КАК ПросмотренноИсполнителем
	                                    |	) КАК ОбсужденияКЗадаче,
	                                    |	Задача.ИсполнителиЗаВесьПериод.(
	                                    |		Ссылка КАК Ссылка,
	                                    |		НомерСтроки КАК НомерСтроки,
	                                    |		Исполнители КАК Исполнители
	                                    |	) КАК ИсполнителиЗаВесьПериод
	                                    |ИЗ
	                                    |	Задача.Задача КАК Задача";
	
	РезультатЗапроса = ЗапросПоКоличесвуСотрудник.Выполнить().Выбрать();
	МассивОтделСотрудникНаРабочемМесте = Новый Массив;
	Пока  РезультатЗапроса.Следующий() Цикл
		ОбходимДанныеЗапроса = РезультатЗапроса.Ссылка;
		ПолучаемТабличнуюЧасть = ОбходимДанныеЗапроса.ЛицаКЗадаче;
		ВыгружаемТЧ = ПолучаемТабличнуюЧасть.Выгрузить();
		Для Каждого СтрокиТч Из ВыгружаемТЧ Цикл			
				НарабочемМесте = Новый Структура("Отдел, Сотрудник");				
				НаРабочемМесте.Вставить("Отдел",СтрокиТч.ЛицаПривлеченныеКЗадаче.Отдел);
				НаРабочемМесте.Вставить("Сотрудник", Строка(СтрокиТч.ЛицаПривлеченныеКЗадаче));
				МассивОтделСотрудникНаРабочемМесте.Добавить(НарабочемМесте);
		КонецЦикла;		
	КонецЦикла;	
	
	
	Для Каждого ЗначМассива Из МассивОтделСотрудникНаРабочемМесте Цикл		
		НаРаботе.Серии.Добавить(Строка(ЗначМассива.Сотрудник));
		НаРаботе.Точки.Добавить(Строка(ЗначМассива.Отдел));
	КонецЦикла;
	

	
	
	
	
	НаРаботе.Обновление = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ПриОткрытииНаСервере(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	НаРаботе.Очистить();
	ВТекущемСпринте.Очистить();
	ВыбраннаяДата = Элемент.ТекстРедактирования;
	ПриОткрытииНаСервере(ВыбраннаяДата);
КонецПроцедуры
