

&НаСервере
Функция ОтпрвитьСообщениеКомандаНаСервере(ТекстСообщения)
	НоваяЗапись = РегистрыСведений.РегистрСведенийЧата.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВремяОтправления = ТекущаяДата();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.СообщениеПользователя = ИмяПользователя() + Символы.ПС + ТекстСообщения +  Символы.ПС + Формат(ТекущаяДата(), "ДЛФ=в");
	НоваяЗапись.ОтправительОбщийЧат = ИмяПользователя();
	НоваяЗапись.Записать();

	
КонецФункции

&НаКлиенте
Процедура ОтпрвитьСообщениеКоманда(Команда)
	ТекстСообщения = Элементы.СообщениеПользователя.ТекстРедактирования;
	ФункцияСсылка = ОтпрвитьСообщениеКомандаНаСервере(ТекстСообщения);
	Сообщение = "";
	Элементы.ЧатОбщий.Обновить();

	
	
		//НавигационаяСсылка = НавСсылка;
		ПоказатьОповещениеПользователя("Новое сообщение в общем чате: " 
		,
		,ТекстСообщения
		,БиблиотекаКартинок.Информация
		,СтатусОповещенияПользователя.Важное
		,Новый УникальныйИдентификатор);
КонецПроцедуры

            