


&НаКлиенте
Процедура ПровестиАнализ(Команда)
	МассивФайлов = Неопределено;

	НачатьПоискФайлов(Новый ОписаниеОповещения("ПровестиАнализЗавершение", ЭтотОбъект), "C:\Users\antonkuklin006\Documents\конфиграция", "*.bsl", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиАнализЗавершение(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	МассивФайлов = НайденныеФайлы;
	МойРезультат = Новый Структура;
	МойРезультат.Вставить("ПроверенноФайловКонфигурации", 0);
	МойРезультат.Вставить("ОбъявленноПроцедурИФункуций", 0);
	МойРезультат.Вставить("ВсегоКомментариев", 0);
	МойРезультат.Вставить("ВсегоСтрокКода", 0);
	МойРезультат.Вставить("ПрисутствуетПустыхСтрок", 0);
	МойРезультат.Вставить("ВсегоСтрок", 0);
	
	
	Для каждого Файл Из МассивФайлов Цикл
		ПросчитатьФайл(Файл.ПолноеИмя, МойРезультат);
	КонецЦикла;
	
	Для каждого Показатель Из МойРезультат Цикл 
		Сообщить(Показатель.Ключ + ": " + Формат(Показатель.Значение, "ЧЧ=0; ЧГ=0"));
	КонецЦикла;

КонецПроцедуры 

Процедура ПросчитатьФайл (ПолноеИмяФайла, МойРезультат)
	МойРезультат["ПроверенноФайловКонфигурации"] = МойРезультат["ПроверенноФайловКонфигурации"] + 1;
	Текст = Новый ЧтениеТекста(ПолноеИмяФайла, КодировкаТекста.ANSI);
	Стр = Текст.ПрочитатьСтроку();
	Пока Стр <> Неопределено Цикл
		ПросчитатьСтроку(Стр, МойРезультат);
		Стр = Текст.ПрочитатьСтроку();
	КонецЦикла;
КонецПроцедуры 

Процедура ПросчитатьСтроку (Стр, МойРезультат)
	МойРезультат["ВсегоСтрок"] = МойРезультат["ВсегоСтрок"] + 1;
	ТекСтрока = СокрЛП(Стр);
	Если ТекСтрока = ""  Тогда
		МойРезультат ["ПрисутствуетПустыхСтрок"] = МойРезультат ["ПрисутствуетПустыхСтрок"] + 1;
	Иначе
		НачСтроки = Лев(СокрЛП(Стр), 2);
		Если НачСтроки = "//"  Тогда
			МойРезультат ["ВсегоКомментариев"] = МойРезультат["ВсегоКомментариев"] + 1;
		ИначеЕсли  ВРег(НачСтроки) = "ФУ" ИЛИ ВРег (НачСтроки) = "ПР" Тогда 
			МойРезультат ["ОбъявленноПроцедурИФункуций"] = МойРезультат ["ОбъявленноПроцедурИФункуций"] + 1;
	
		Иначе
		  МойРезультат["ВсегоСтрокКода"] = МойРезультат["ВсегоСтрокКода"] + 1; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

 